cask_args appdir: '/Applications'

tap 'homebrew/services'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/bundle"


#tap "homebrew/dupes"
#tap "homebrew/php"
#tap "homebrew/games"
#tap "bramstein/webfonttools"
#tap "ksonnet/tap"


brew "ack"
brew 'antigen'
brew "python"
brew "asciinema"
brew "awscli"
brew "certbot"
brew "coreutils"
brew "docker", link: false
brew "docker-machine-driver-xhyve"
brew "findutils"
brew "gettext", link: true
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "gnu-sed", args: ["with-default-names"]
brew "go"
brew "grep"
brew "jq"
brew "kubernetes-cli"
brew "kops"
brew "kubernetes-helm"
brew "libffi"
brew "libxml2", link: true
brew "libxslt", link: true
brew "lynis"
brew 'mackup'
brew 'mas'
brew "mongodb"
brew "mono"
brew "moreutils"
brew "protobuf"
brew 'mas'
brew "mosh"
brew "openssh"
brew "packer"
brew "pkg-config"
brew "screen"
brew 'stow'
brew "telnet"
brew "terminal-notifier"
brew "terraform"
brew "terragrunt"
brew 'thefuck'
brew 'tmux'
brew "tree"
brew 'trash'
brew "unzip"
brew "vault"
brew "watch"
brew "wget"
brew 'z'
brew "zsh"
brew "zsh-completions"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "bramstein/webfonttools/woff2"
brew "ksonnet/tap/ks"

# Install packages
cask 'alfred'
cask 'atext'
cask 'bartender'
cask "docker"
cask "dropbox"
cask "google-chrome"
cask 'fluor'
cask 'flux'
cask "iterm2"
cask 'jetbrains-toolbox'
cask "lastpass"
cask 'keybase'
cask "minikube"
cask 'micro-snitch'
cask 'nordvpn'
cask "slack"
cask 'shiftit'
cask "sublime-text"
cask "virtualbox"

# Install QuickLook helpers
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'quicklook-csv'

# Install fonts
cask 'font-hack'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-league-gothic'
cask 'font-noto-sans'
cask 'font-noto-sans-cjk'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install apps from Mac App Store
mas 'LastPass', id: 926036361
mas 'Kindle', id: 405399194
mas 'Amphetamine', id: 937984704
mas 'Slack', id: 803453959
mas 'Speedtest', id: 1153157709
mas 'Tweetbot', id: 557168941


# Optionals

# Programming languages
# brew 'elixir'
# cask 'java'
brew 'golang'
brew 'python'

# Tools
brew 'ansible'
# cask 'insomnia'
# cask 'vagrant'
cask 'virtualbox'
# brew 'yarn'

# Database tools
# cask 'pgadmin4'
# cask 'postgres'
# brew 'postgresql'
# brew 'sqlite'
# cask 'sqlitebrowser'

# Applications
mas 'aText', id: 488566438 # install aText from Mac App Store to transfer license
# mas 'Final Cut Pro', 424389933
# mas 'Logic Pro X', 634148309
mas 'Xcode', 497799835
